// Ranks

const RANK_DESCS = {
	1: "最大速度增加1米/秒。",
	2: "每次提升级别都使加速度和最大速度增加10%。",
	3: "使加速度翻倍。",
	4: "每次提升阶层都使加速度和最大速度变为原来的3倍。",
	5: "每次提升级别都使加速度和最大速度增加97.5%。",
	8: "每次提升级别都使最大速度增加10%。",
	10: "使加速度翻倍。",
	14: "加速度和最大速度变为某个数值的倍率，此数值为(n+1)^1.6，其中n为火箭燃料数值。",
	15: "使加速度变为原来的4倍。",
	20: "使智慧的获取量翻倍。",
	25: "使加速度变为原来的10倍。",
	30: "使智慧的获取量变为原来的3倍。",
	35: "时间加快50%。",
	40: "使智慧的获取量变为某个数值的倍率，此数值为不大于碎屑数值的质数数量(最小为1，在1000000000个质数后到达软上限)。",
	45: "时间加快80%。",
	50: "使加速度变为原来的15倍。",
	55: "每次提升级别都使最大速度翻倍。",
	60: "使碎屑的获取量翻倍。",
	70: "时间加快40%。",
	75: "使加速度变为原来的25倍。",
	80: "时间加快50%。",
	90: "时间加快75%。",
	100: "使火箭的获取量翻倍。",
	111: "每次提升级别都使智慧的获取量翻倍。",
	125: "时间加快50%。",
	150: "时间加快55%。",
	175: "时间加快60%。",
	200: "时间加快70%。",
	250: "时间加快80%。",
	300: "时间加快90%。",
	500: "时间加快95%。",
	1000: "时间加快98%。",
	10000: "时间加快100%。"
};

const DEFAULT_RANK_DESC = "提升级别。";

// Tiers

const TIER_DESCS = {
	0: "级别需求的公式缓和25%。",
	1: "如果您至少达到级别3，则使加速度翻倍，且最大速度变为原来的5倍。",
	2: "每次提升阶层都使级别需求的公式缓和10%。",
	3: "使加速度变为原来的3倍。",
	4: "使智慧的获取量翻倍。",
	5: "使加速度变为原来的5倍。",
	6: "时间加快50%。",
	7: "每有1点火箭燃料，时间就加快10%。",
	8: "使加速度变为原来的10倍。",
	9: "根据智慧数值，增加最大速度的数值。",
	10: "使加速度变为原来的15倍。",
	12: "使智慧的获取量变为原来的3倍。",
	13: "使智慧的获取量变为原来的4倍。",
	15: "使加速度变为原来的25倍。",
	16: "时间加快60%。",
	18: "时间加快80%。",
	20: "时间加快100%。"
};

const DEFAULT_TIER_DESC = "提升阶层。";
